
Процедура ОбработкаПроведения(Отказ, Режим)
        // регистр РегистрНачисленияЗарплаты
    Движения.РегистрНачисленияЗарплаты.Записывать = Истина;
    
    Движение = Движения.РегистрНачисленияЗарплаты.Добавить();  

   
    Движение.Сторно = Ложь;
    Движение.ВидРасчета = ПланыВидовРасчета.Начисления.НеВыходСотрудника;
    Движение.ПериодДействияНачало = ДатаНачала;
    Движение.ПериодДействияКонец = ДатаОкончания;
    Движение.ПериодРегистрации = Дата;
    Движение.Сотрудник = Сотрудник;
    
    
       
    
    
    КонецПроцедуры
