 
 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    
           
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |   РегистрБухУчетОстатки.Счет КАК Счет,
        |   РегистрБухУчетОстатки.СуммаОстатокДт КАК СуммаОстатокДт,
        |   РегистрБухУчетОстатки.СуммаОстатокКт КАК СуммаОстатокКт
        |ИЗ
        |   РегистрБухгалтерии.РегистрБухУчет.Остатки(&Период, Счет В (&СчетВыручка, &СчетСебестоимость), ) КАК РегистрБухУчетОстатки";
    
    Запрос.УстановитьПараметр("Период", КонецМесяца(Дата));
    Запрос.УстановитьПараметр("СчетВыручка", ПланыСчетов.БухУчет.Выручка);
    Запрос.УстановитьПараметр("СчетСебестоимость", ПланыСчетов.БухУчет.Себестоимость);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    
    СуммаВыручки = 0;
    СуммаСебестоимости = 0;
    
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл   
        
        Если  ВыборкаДетальныеЗаписи.Счет = ПланыСчетов.БухУчет.Выручка Тогда 
            СуммаВыручки = ВыборкаДетальныеЗаписи.СуммаОстатокКт;
        ИначеЕсли ВыборкаДетальныеЗаписи.Счет = ПланыСчетов.БухУчет.Себестоимость Тогда
            СуммаСебестоимости = ВыборкаДетальныеЗаписи.СуммаОстатокДт ;  
            КонецЕсли;
        КонецЦикла;
        
    
    Движения.РегистрБухУчет.Записывать = Истина;
    Проводка = Движения.РегистрБухУчет.Добавить();
    Проводка.Период = Дата;
    Проводка.СчетДт = ПланыСчетов.БухУчет.Выручка;
    Проводка.СчетКт = ПланыСчетов.БухУчет.Прибыль;
    Проводка.Сумма = СуммаВыручки; 
    
    Движения.РегистрБухУчет.Записывать = Истина;
    Проводка = Движения.РегистрБухУчет.Добавить();
    Проводка.Период = Дата;
    Проводка.СчетДт = ПланыСчетов.БухУчет.Прибыль;
    Проводка.СчетКт = ПланыСчетов.БухУчет.Себестоимость;
    Проводка.Сумма = СуммаСебестоимости; 
    
    
КонецПроцедуры
 Функция ОстататокПоСчету (Счет, Период) 
    
            
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |   РегистрБухУчетОстатки.СуммаОстатокДт КАК СуммаОстатокДт,
        |   РегистрБухУчетОстатки.СуммаОстатокКт КАК СуммаОстатокКт
        |ИЗ
        |   РегистрБухгалтерии.РегистрБухУчет.Остатки(&Период, Счет = &Счет, ) КАК РегистрБухУчетОстатки";
    
    Запрос.УстановитьПараметр("Период", Период);
    Запрос.УстановитьПараметр("Счет", Счет);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Если   РезультатЗапроса.Пустой() Тогда
        Возврат 0;
    КонецЕсли;
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    
    ВыборкаДетальныеЗаписи.Следующий() ;    
    Если Счет.Вид = ВидСчета.Активный Тогда
        Возврат ВыборкаДетальныеЗаписи.СуммаОстатокДт;
    Иначе
        Возврат ВыборкаДетальныеЗаписи.СуммаОстатокКт;
    КонецЕсли;
КонецФункции;
