

&НаКлиенте
Процедура ПересчетКоличествоПриИзменении(ТДТовары) Экспорт
    
    ТДТовары.Сумма = ТДТовары.Количество * ТДТовары.Цена ; 
    
КонецПроцедуры

&НаКлиенте
Процедура ПересчетЦенаПриИзменении(ТДТовары)  Экспорт   
    
        ТДТовары.Сумма = ТДТовары.Количество * ТДТовары.Цена ;

КонецПроцедуры

&НаКлиенте
Процедура ПересчетСуммаПриИзменении(ТДТовары) Экспорт  
    
          Если ТДТовары.Сумма = 0 Тогда
        ТДТовары.Цена = 0
    Иначе 
        ТДТовары.Цена = ТДТовары.Сумма / ТДТовары.Количество ;
    КонецЕсли;         
 
      КонецПроцедуры
