
Процедура ОбработкаПроведения(Отказ, Режим)
       // регистр ЗадолжностьПередСторудниками Расход
    Движения.ЗадолжностьПередСторудниками.Записывать = Истина;
    Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
        Движение = Движения.ЗадолжностьПередСторудниками.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
        Движение.Период = Дата;
        Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
        Движение.Долг = ТекСтрокаСотрудники.СуммаВыплат;
    КонецЦикла;

   
КонецПроцедуры
