
Процедура ОбработкаПроведения(Отказ, Режим)
    //{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
    // Данный фрагмент построен конструктором.
    // При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
    
    // регистр ОстаткиТоваров Приход
    Движения.ОстаткиТоваров.Записывать = Истина;
    Движения.Закупки.Записывать = Истина;
    Для Каждого ТекСтрокаТовары Из Товары Цикл
        Движение = Движения.ОстаткиТоваров.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
        Движение.Период = Дата;
        Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
        Движение.Количество = ТекСтрокаТовары.Количество;
        Движение.Сумма = ТекСтрокаТовары.Сумма;
        
        // регистр Закупки 
        Движение = Движения.Закупки.Добавить();
        Движение.Период = Дата;
        Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
        Движение.Контрагент = Поставщик;
        Движение.Сумма = ТекСтрокаТовары.Сумма;
        Движение.Количество = ТекСтрокаТовары.Количество;
    КонецЦикла;
    
    // регистр РегистрБухУчет 
    Движения.РегистрБухУчет.Записывать = Истина;
    Движение = Движения.РегистрБухУчет.Добавить();
    Движение.СчетДт = ПланыСчетов.БухУчет.Товары;
    Движение.СчетКт = ПланыСчетов.БухУчет.РасчетыСПоставщиками;
    Движение.Период = Дата;
    Движение.Сумма = СуммаДокумента;
    
    //}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    
       СуммаДокумента = Товары.Итог("Сумма");
    
 
КонецПроцедуры
