
Процедура ОбработкаПроведения(Отказ, Режим)
   	// регистр РегистрНачисленияЗарплаты
	Движения.РегистрНачисленияЗарплаты.Записывать = Истина;
    Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
        Движение = Движения.РегистрНачисленияЗарплаты.Добавить();
        Движение.Сторно = Ложь;
        Движение.ВидРасчета = ПланыВидовРасчета.Начисления.Премия;
        Движение.ПериодДействияНачало = НачалоМесяца(Дата);
        Движение.ПериодДействияКонец = КонецМесяца(Дата);
        Движение.ПериодРегистрации = Дата;
        Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
        Движение.Результат = ТекСтрокаСотрудники.СуммаПремии;
        
        // регистр ЗадолжностьПередСторудниками Приход
        Движения.ЗадолжностьПередСторудниками.Записывать = Истина;
        Движение = Движения.ЗадолжностьПередСторудниками.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
        Движение.Период = Дата;
        Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
        Движение.Долг = ТекСтрокаСотрудники.СуммаПремии;
    КонецЦикла;

	КонецПроцедуры
