
Процедура Условие1ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
    
    
    Результат = ПройденТестАдмиминстрирование;
    
КонецПроцедуры

Процедура Условие2ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат) 
    
       Результат = ПройденТестПрограммирование;

КонецПроцедуры

Процедура Действие1ПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
    ПредложеннаяВакансия = Перечисления.Вакансии.Оператор;
КонецПроцедуры

Процедура Действие2ПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
   ПредложеннаяВакансия = Перечисления.Вакансии.Администратор;
КонецПроцедуры

Процедура Действие3ПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
     ПредложеннаяВакансия = Перечисления.Вакансии.Программист;
КонецПроцедуры
