
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    

    ТекущаяДата = НачалоГода(Дата);
    ДатаКонца = КонецГода(Дата);
    Движения.ГрафикРаботы.Записывать = Истина;
    
    Пока ТекущаяДата <= ДатаКонца Цикл 
        
        Движение =  Движения.ГрафикРаботы.Добавить();
        Движение.Дата = ТекущаяДата;

        Если   ДеньНедели(ТекущаяДата) <= 6 Тогда
            Движение.РабочийДень = 1;
        Иначе
            Движение.РабочийДень = 0;
        КонецЕсли; 
        ТекущаяДата = ТекущаяДата + 86400;
    КонецЦикла;
    
КонецПроцедуры
